{
<<<<<<< HEAD
  "class_name": "Sequential",
  "config": {
    "name": "cnn_complex",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            512
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "embedding_input"
        }
      },
      {
=======
  "module": "keras",
  "class_name": "Sequential",
  "config": {
    "name": "cnn_complex",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
        "name": "float32"
      },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
        "class_name": "Embedding",
        "config": {
          "name": "embedding",
          "trainable": true,
<<<<<<< HEAD
          "batch_input_shape": [
            null,
            512
          ],
          "dtype": "float32",
          "input_dim": 71,
          "output_dim": 128,
          "embeddings_initializer": {
            "class_name": "RandomUniform",
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": null
            }
=======
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "input_dim": 71,
          "output_dim": 128,
          "embeddings_initializer": {
            "module": "keras.initializers",
            "class_name": "RandomUniform",
            "config": {
              "seed": null,
              "minval": -0.05,
              "maxval": 0.05
            },
            "registered_name": null
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
<<<<<<< HEAD
          "mask_zero": false,
          "input_length": 512
        }
      },
      {
=======
          "mask_zero": false
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
        "class_name": "Conv1D",
        "config": {
          "name": "conv1",
          "trainable": true,
<<<<<<< HEAD
          "dtype": "float32",
          "filters": 128,
=======
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "filters": 64,
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
<<<<<<< HEAD
          "padding": "valid",
=======
          "padding": "same",
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
<<<<<<< HEAD
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
=======
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
<<<<<<< HEAD
        }
      },
      {
=======
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "bn1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
        "class_name": "MaxPooling1D",
        "config": {
          "name": "pool1",
          "trainable": true,
<<<<<<< HEAD
          "dtype": "float32",
          "strides": [
            3
          ],
          "pool_size": [
            3
          ],
          "padding": "valid",
          "data_format": "channels_last"
        }
      },
      {
=======
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "pool_size": [
            2
          ],
          "padding": "valid",
          "strides": [
            2
          ],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "drop1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "rate": 0.2,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
        "class_name": "Conv1D",
        "config": {
          "name": "conv2",
          "trainable": true,
<<<<<<< HEAD
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [
            7
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv3",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
=======
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "filters": 128,
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
          "kernel_size": [
            5
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
<<<<<<< HEAD
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
=======
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
<<<<<<< HEAD
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv4",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
=======
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "bn2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
        "class_name": "MaxPooling1D",
        "config": {
          "name": "pool2",
          "trainable": true,
<<<<<<< HEAD
          "dtype": "float32",
          "strides": [
            3
          ],
          "pool_size": [
            3
          ],
          "padding": "valid",
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv5",
          "trainable": true,
          "dtype": "float32",
          "filters": 196,
          "kernel_size": [
            5
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv6",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
=======
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "pool_size": [
            2
          ],
          "padding": "valid",
          "strides": [
            2
          ],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "drop2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "rate": 0.2,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv1D",
        "config": {
          "name": "conv3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "filters": 256,
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
<<<<<<< HEAD
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
=======
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
<<<<<<< HEAD
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv7",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
          "kernel_size": [
            5
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv8",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv9",
          "trainable": true,
          "dtype": "float32",
          "filters": 196,
          "kernel_size": [
            5
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv10",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            7
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv11",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling1D",
        "config": {
          "name": "pool3",
          "trainable": true,
          "dtype": "float32",
          "strides": [
            3
          ],
          "pool_size": [
            3
          ],
          "padding": "valid",
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv12",
          "trainable": true,
          "dtype": "float32",
          "filters": 196,
          "kernel_size": [
            5
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv13",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            7
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling1D",
        "config": {
          "name": "pool4",
          "trainable": true,
          "dtype": "float32",
          "strides": [
            3
          ],
          "pool_size": [
            3
          ],
          "padding": "valid",
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv14",
          "trainable": true,
          "dtype": "float32",
          "filters": 196,
          "kernel_size": [
            5
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv15",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            7
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv16",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "tanh",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        }
      },
      {
=======
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "bn3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "drop3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "rate": 0.3,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "GlobalMaxPooling1D",
        "config": {
          "name": "global_pool",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "data_format": "channels_last",
          "keepdims": false
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 128,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "drop4",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "rate": 0.3,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
        "class_name": "Dense",
        "config": {
          "name": "output",
          "trainable": true,
<<<<<<< HEAD
          "dtype": "float32",
=======
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
          "units": 1,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
<<<<<<< HEAD
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      }
    ]
  },
  "keras_version": "2.10.0",
  "backend": "tensorflow"
=======
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null
      }
    ]
  },
  "registered_name": null,
  "compile_config": {
    "optimizer": {
      "module": "keras.optimizers",
      "class_name": "Adam",
      "config": {
        "name": "adam",
        "learning_rate": 0.0010000000474974513,
        "weight_decay": null,
        "clipnorm": null,
        "global_clipnorm": null,
        "clipvalue": null,
        "use_ema": false,
        "ema_momentum": 0.99,
        "ema_overwrite_frequency": null,
        "loss_scale_factor": null,
        "gradient_accumulation_steps": null,
        "beta_1": 0.9,
        "beta_2": 0.999,
        "epsilon": 1e-07,
        "amsgrad": false
      },
      "registered_name": null
    },
    "loss": "binary_crossentropy",
    "loss_weights": null,
    "metrics": [
      "accuracy"
    ],
    "weighted_metrics": null,
    "run_eagerly": false,
    "steps_per_execution": 1,
    "jit_compile": true
  }
>>>>>>> 98662543af963e7dd81efc2fdc51b519232a5952
}