Model: "cnn_base"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 embedding (Embedding)       (None, 512, 128)          9088      
                                                                 
 conv1 (Conv1D)              (None, 510, 128)          49280     
                                                                 
 flatten (Flatten)           (None, 65280)             0         
                                                                 
 output (Dense)              (None, 1)                 65281     
                                                                 
=================================================================
Total params: 123,649
Trainable params: 123,649
Non-trainable params: 0
_________________________________________________________________
